Model: "hourglass_unet_etwork"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_5 (InputLayer)            [(None, 64, 64, 3)]  0                                            
__________________________________________________________________________________________________
conv2d_84 (Conv2D)              (None, 64, 64, 32)   896         input_5[0][0]                    
__________________________________________________________________________________________________
max_pooling2d_16 (MaxPooling2D) (None, 32, 32, 32)   0           conv2d_84[0][0]                  
__________________________________________________________________________________________________
conv2d_85 (Conv2D)              (None, 32, 32, 32)   9248        max_pooling2d_16[0][0]           
__________________________________________________________________________________________________
max_pooling2d_17 (MaxPooling2D) (None, 16, 16, 32)   0           conv2d_85[0][0]                  
__________________________________________________________________________________________________
conv2d_86 (Conv2D)              (None, 16, 16, 32)   9248        max_pooling2d_17[0][0]           
__________________________________________________________________________________________________
max_pooling2d_18 (MaxPooling2D) (None, 8, 8, 32)     0           conv2d_86[0][0]                  
__________________________________________________________________________________________________
conv2d_87 (Conv2D)              (None, 8, 8, 32)     9248        max_pooling2d_18[0][0]           
__________________________________________________________________________________________________
batch_normalization_48 (BatchNo (None, 8, 8, 32)     128         conv2d_87[0][0]                  
__________________________________________________________________________________________________
re_lu_48 (ReLU)                 (None, 8, 8, 32)     0           batch_normalization_48[0][0]     
__________________________________________________________________________________________________
conv2d_89 (Conv2D)              (None, 8, 8, 16)     528         re_lu_48[0][0]                   
__________________________________________________________________________________________________
batch_normalization_49 (BatchNo (None, 8, 8, 16)     64          conv2d_89[0][0]                  
__________________________________________________________________________________________________
batch_normalization_51 (BatchNo (None, 16, 16, 32)   128         conv2d_86[0][0]                  
__________________________________________________________________________________________________
re_lu_49 (ReLU)                 (None, 8, 8, 16)     0           batch_normalization_49[0][0]     
__________________________________________________________________________________________________
re_lu_51 (ReLU)                 (None, 16, 16, 32)   0           batch_normalization_51[0][0]     
__________________________________________________________________________________________________
conv2d_90 (Conv2D)              (None, 8, 8, 16)     2320        re_lu_49[0][0]                   
__________________________________________________________________________________________________
conv2d_93 (Conv2D)              (None, 16, 16, 16)   528         re_lu_51[0][0]                   
__________________________________________________________________________________________________
batch_normalization_50 (BatchNo (None, 8, 8, 16)     64          conv2d_90[0][0]                  
__________________________________________________________________________________________________
batch_normalization_52 (BatchNo (None, 16, 16, 16)   64          conv2d_93[0][0]                  
__________________________________________________________________________________________________
batch_normalization_54 (BatchNo (None, 32, 32, 32)   128         conv2d_85[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_19 (MaxPooling2D) (None, 4, 4, 32)     0           conv2d_87[0][0]                  
__________________________________________________________________________________________________
re_lu_50 (ReLU)                 (None, 8, 8, 16)     0           batch_normalization_50[0][0]     
__________________________________________________________________________________________________
re_lu_52 (ReLU)                 (None, 16, 16, 16)   0           batch_normalization_52[0][0]     
__________________________________________________________________________________________________
re_lu_54 (ReLU)                 (None, 32, 32, 32)   0           batch_normalization_54[0][0]     
__________________________________________________________________________________________________
conv2d_88 (Conv2D)              (None, 4, 4, 32)     9248        max_pooling2d_19[0][0]           
__________________________________________________________________________________________________
conv2d_91 (Conv2D)              (None, 8, 8, 32)     544         re_lu_50[0][0]                   
__________________________________________________________________________________________________
conv2d_94 (Conv2D)              (None, 16, 16, 16)   2320        re_lu_52[0][0]                   
__________________________________________________________________________________________________
conv2d_97 (Conv2D)              (None, 32, 32, 16)   528         re_lu_54[0][0]                   
__________________________________________________________________________________________________
up_sampling2d_16 (UpSampling2D) (None, 8, 8, 32)     0           conv2d_88[0][0]                  
__________________________________________________________________________________________________
add_32 (Add)                    (None, 8, 8, 32)     0           conv2d_87[0][0]                  
                                                                 conv2d_91[0][0]                  
__________________________________________________________________________________________________
batch_normalization_53 (BatchNo (None, 16, 16, 16)   64          conv2d_94[0][0]                  
__________________________________________________________________________________________________
batch_normalization_55 (BatchNo (None, 32, 32, 16)   64          conv2d_97[0][0]                  
__________________________________________________________________________________________________
batch_normalization_57 (BatchNo (None, 64, 64, 32)   128         conv2d_84[0][0]                  
__________________________________________________________________________________________________
add_33 (Add)                    (None, 8, 8, 32)     0           up_sampling2d_16[0][0]           
                                                                 add_32[0][0]                     
__________________________________________________________________________________________________
re_lu_53 (ReLU)                 (None, 16, 16, 16)   0           batch_normalization_53[0][0]     
__________________________________________________________________________________________________
re_lu_55 (ReLU)                 (None, 32, 32, 16)   0           batch_normalization_55[0][0]     
__________________________________________________________________________________________________
re_lu_57 (ReLU)                 (None, 64, 64, 32)   0           batch_normalization_57[0][0]     
__________________________________________________________________________________________________
conv2d_92 (Conv2D)              (None, 8, 8, 32)     9248        add_33[0][0]                     
__________________________________________________________________________________________________
conv2d_95 (Conv2D)              (None, 16, 16, 32)   544         re_lu_53[0][0]                   
__________________________________________________________________________________________________
conv2d_98 (Conv2D)              (None, 32, 32, 16)   2320        re_lu_55[0][0]                   
__________________________________________________________________________________________________
conv2d_101 (Conv2D)             (None, 64, 64, 16)   528         re_lu_57[0][0]                   
__________________________________________________________________________________________________
up_sampling2d_17 (UpSampling2D) (None, 16, 16, 32)   0           conv2d_92[0][0]                  
__________________________________________________________________________________________________
add_34 (Add)                    (None, 16, 16, 32)   0           conv2d_86[0][0]                  
                                                                 conv2d_95[0][0]                  
__________________________________________________________________________________________________
batch_normalization_56 (BatchNo (None, 32, 32, 16)   64          conv2d_98[0][0]                  
__________________________________________________________________________________________________
batch_normalization_58 (BatchNo (None, 64, 64, 16)   64          conv2d_101[0][0]                 
__________________________________________________________________________________________________
add_35 (Add)                    (None, 16, 16, 32)   0           up_sampling2d_17[0][0]           
                                                                 add_34[0][0]                     
__________________________________________________________________________________________________
re_lu_56 (ReLU)                 (None, 32, 32, 16)   0           batch_normalization_56[0][0]     
__________________________________________________________________________________________________
re_lu_58 (ReLU)                 (None, 64, 64, 16)   0           batch_normalization_58[0][0]     
__________________________________________________________________________________________________
conv2d_96 (Conv2D)              (None, 16, 16, 32)   9248        add_35[0][0]                     
__________________________________________________________________________________________________
conv2d_99 (Conv2D)              (None, 32, 32, 32)   544         re_lu_56[0][0]                   
__________________________________________________________________________________________________
conv2d_102 (Conv2D)             (None, 64, 64, 16)   2320        re_lu_58[0][0]                   
__________________________________________________________________________________________________
up_sampling2d_18 (UpSampling2D) (None, 32, 32, 32)   0           conv2d_96[0][0]                  
__________________________________________________________________________________________________
add_36 (Add)                    (None, 32, 32, 32)   0           conv2d_85[0][0]                  
                                                                 conv2d_99[0][0]                  
__________________________________________________________________________________________________
batch_normalization_59 (BatchNo (None, 64, 64, 16)   64          conv2d_102[0][0]                 
__________________________________________________________________________________________________
add_37 (Add)                    (None, 32, 32, 32)   0           up_sampling2d_18[0][0]           
                                                                 add_36[0][0]                     
__________________________________________________________________________________________________
re_lu_59 (ReLU)                 (None, 64, 64, 16)   0           batch_normalization_59[0][0]     
__________________________________________________________________________________________________
conv2d_100 (Conv2D)             (None, 32, 32, 32)   9248        add_37[0][0]                     
__________________________________________________________________________________________________
conv2d_103 (Conv2D)             (None, 64, 64, 32)   544         re_lu_59[0][0]                   
__________________________________________________________________________________________________
up_sampling2d_19 (UpSampling2D) (None, 64, 64, 32)   0           conv2d_100[0][0]                 
__________________________________________________________________________________________________
add_38 (Add)                    (None, 64, 64, 32)   0           conv2d_84[0][0]                  
                                                                 conv2d_103[0][0]                 
__________________________________________________________________________________________________
add_39 (Add)                    (None, 64, 64, 32)   0           up_sampling2d_19[0][0]           
                                                                 add_38[0][0]                     
__________________________________________________________________________________________________
conv2d_104 (Conv2D)             (None, 64, 64, 16)   4624        add_39[0][0]                     
==================================================================================================
Total params: 84,848
Trainable params: 84,336
Non-trainable params: 512
__________________________________________________________________________________________________
